{
  "date": "2020-05-17T08:37:29.033Z",
  "title": "Artikel Pertama dan Rencana Website Erdiawan.com",
  "description": "Ini merupakan artikel pertama untuk halaman blog erdiawan.com. Setelah bingung memilih banyak CMS untuk halaman blog ini, akhirnya jatuh ke satu pilihan CMS.",
  "body": "Halo selamat datang di blog pribadi saya. Ini merupakan artikel pertama untuk halaman blog ini. Setelah memilih banyak CMS yang ingin saya gunakan untuk halaman blog ini seperti Wordpress dengan hosting terpisah, [Butter CMS](https://buttercms.com/), [Dato CMS](https://www.datocms.com/), dan masih banyak lagi. Akhirnya pilihan terakhir, saya memutuskan untuk menggunakan [Netlify CMS](https://www.netlifycms.org/). Alasannya saya tidak ingin ribet karna web ini sendiri di hosting di Netlify. \n\nSelain itu saya ingin bereksperimen dengan SEO *onsite* dan Google Data Structure. Ya tentu saja tujuannya agar tulisan tulisan yang saya tulis disini bisa ditemukan di penelusuran Google. Keuntungan dari menggunakan Netlify CMS ini ialah *static* dan menggunakan editor Markdown. Halaman *static* dibutuhkan agar halaman web terbaca oleh bot Google.\n\n### Apa rencana berikutnya untuk Erdiawan.com?\n\n*Well*, pada awal dibuatnya website ini ialah untuk menampilkan beberapa portfolio saya. Walaupun pada akhirnya website ini saya gunakan sebagai bahan buat eksperimen, belajar dan explorasi JavaScript. Salah satunya bahan eksperimen tersebut ialah halaman Covid-19. Ya memang halaman tersebut tidak ditujukan untuk public. Toh orang akan tetap mengunjungi website resminya langsung, seperti website [CSSE John Hopkins](https://coronavirus.jhu.edu/map.html) atau [Covid19.go.id](http://covid19.go.id). Saya membuat halaman tersebut untuk belajar memvisualiasikan data. Apakah akan ada update? Ada beberapa hal yang saya pikirkan seperti menambah data ODP.\n\n![Erdiawan.com Covid19 Page](/img/erdiawan.com-covid19-page.png \"Erdiawan.com Covid19 Page\")\n\nBeberapa hal yang bisa saya ambil pelajaran dari mengembangkan halaman Covid19\n\n* Menampilkan data dari API dan memilih *object* yang ingin ditampilkan\n* Menggabungkan beberapa *Array* menjadi satu\n* Membuat fitur penelusuran\n* Menggunakan beberapa kondisi dan handling error\n* Menggunakan ChartJS untuk menampilkan data\n\nOh ya API nya yang dibuat oleh Mathdroid, mengambil data dari ArcGIS nya CSSE John Hopkins dan halaman resmi Covid19.go.id . Kalau kamu mau mencoba bereksperimen dan explorasi bisa mengunjungi [Githubnya](https://github.com/mathdroid).\n\nHmmm... apa lagi ya? Pastinya website ini akan saya improve lagi agar lebih ringan di *load* di *mobile*. Seperti bikin kondisi agar gambar yang di *serve* sesuai dengan resolusi *device*, menggunakan *lazyload*, *service worker* dan masih banyak lagi.\n\nMungkin kita bisa mutualan di Twitter saya di [@aerdiawan_](http://twitter.com/aerdiawan_) . Saya biasanya update terkait *dev* atau sekedar nge-tweet terkait development atau ngepost sh*t post untuk hiburan.",
  "featured_image": {
    "src": "/img/erdiawan-wallpaper.jpg",
    "alt": "Erdiawan Anna",
    "title": "Erdiawan Anna"
  },
  "tags": [
    "Stories",
    "Devs"
  ],
  "author": {
    "name": "Erdiawan Anna",
    "avatar": "/img/erdi-3.jpg"
  },
  "slug": "2020-05-17-artikel-pertama"
}